study/cases_transient/cylT_Re60_dt10/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2312                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    p       { solver GAMG; smoother GaussSeidel; tolerance 1e-7; relTol 0.01; }
    pFinal  { $p; relTol 0.01; }
    "(U|k|epsilon)"      { solver smoothSolver; smoother symGaussSeidel; tolerance 1e-8; relTol 0.1; }
    "(U|k|epsilon)Final" { $U; relTol 0.1; }
}

PIMPLE
{
    nOuterCorrectors 50;
    nCorrectors     1;
    nNonOrthogonalCorrectors 0;
    pRefCell        0;
    pRefValue       0;
    residualControl
    {
        p { tolerance 1e-4; relTol 0; }
        U { tolerance 1e-5; relTol 0; }
    }
}

relaxationFactors
{
    fields { p 0.3; pFinal 1; }
    equations { U 0.7; UFinal 1; }
}
